import '../model/division.dart';

final List<Division> divisionList = [
  //Yangon Division
  Division(
    name: "ရန်ကုန်တိုင်း",
    townShipMap: {
      '2500': [
        "အလုံ ပို့ခ ၂၅၀၀ ကျပ်",
        "ဗဟန်း ပို့ခ ၂၅၀၀ ကျပ်",
        "ဗိုလ်တထောင် ပို့ခ ၂၅၀၀ ကျပ်",
        "မရမ်းကုန်း ပို့ခ ၂၅၀၀ ကျပ်",
        "လှိုင် ပို့ခ ၂၅၀၀ ကျပ်",
        "အင်းစိန် ပို့ခ ၂၅၀၀ ကျပ်",
        "ရွှေပေါက်ကံ ပို့ခ ၂၅၀၀ ကျပ်",
        "အရှေ့ဒဂုံ ပို့ခ ၂၅၀၀ ကျပ်",
        "တောင်ဥက္ကလာပ ပို့ခ ၂၅၀၀ ကျပ်",
        "သန်လျင် ပို့ခ ၂၅၀၀ ကျပ် ( ကျိုက်ခေါက်ဘုရားထိ )",
        "လှိုင်သာယာ ပို့ခ ၂၅၀၀ ကျပ် ( ထန်းတပင်နည်းပညာတက္ကသိုလ် )",
        "ရွှေပြည်သာ ပို့ခ ၂၅၀၀ ကျပ် ( တာဆုံ။အောက်ဂိတ် )",
        "မင်္ဂလာဒုံ ပို့ခ ၂၅၀၀ ကျပ် ( ထောက်ကြန့်လမ်းဆုံထိ )",
        "ကျောက်တံတား ပို့ခ ၂၅၀၀ ကျပ်",
        "ပန်းဘဲတန်း ပို့ခ ၂၅၀၀ ကျပ်",
        "မြောက်ဒဂုံ ပို့ခ ၂၅၀၀ ကျပ် ( ရွာသာကြီးတိုးဂိတ်အနီး )",
        "မင်္ဂလာတောင်ညွန့်  ပို့ခ ၂၅၀၀ ကျပ်",
        "တောင်ဒဂုံ ပို့ခ ၂၅၀၀ ကျပ် ( စီးပွားရေးတက္ကသိုလ် )",
        "ပုဇွန်တောင် ပို့ခ ၂၅၀၀ ကျပ်",
        "စမ်းချောင်း ပို့ခ ၂၅၀၀ ကျပ်",
        "ဒေါပုံ  ပို့ခ ၂၅၀၀ ကျပ်",
        "ကမာရွတ် ပို့ခ ၂၅၀၀ ကျပ်",
        "ကြည့်မြင်တိုင် ပို့ခ ၂၅၀၀ ကျပ်",
        "ဒဂုံဆိပ်ကမ်း ပို့ခ ၂၅၀၀ ကျပ်",
        "သင်္ယန်းကျွန်း ပို့ခ ၂၅၀၀ ကျပ်",
        "တာမွေ ပို့ခ ၂၅၀၀ ကျပ်",
        "ရန်ကင်း ပို့ခ ၂၅၀၀ ကျပ်",
        "လမ်းမတော် ပို့ခ ၂၅၀၀ ကျပ်",
        "လသာ ပို့ခ ၂၅၀၀ ကျပ်",
        "သာကေတ ပို့ခ ၂၅၀၀ ကျပ်",
        "မြောက်ဥက္ကလာပ ပို့ခ ၂၅၀၀ ကျပ်",
        "ယုဇနဥယျာဉ် ပို့ခ ၂၅၀၀ ကျပ်",
      ],
    },
  ),
  //Mandalay Division
  Division(
    name: "မန္တလေးတိုင်း",
    townShipMap: {
      "1500": [
        "အောင်မြေသာဇံ ပို့ခ ၁၅၀၀ ကျပ်",
        "ချမ်းအေးသာဇံ ပို့ခ ၁၅၀၀ ကျပ်",
        "ချမ်းမြသာစည် ပို့ခ ၁၅၀၀ ကျပ်",
      ],
      "2000": [
        "ပြည်ကြီးတံခွန် ပို့ခ ၂၀၀၀ ကျပ်",
      ],
      "2500": [
        "စက်မှု ပို့ခ ၂၅၀၀ ကျပ်",
      ]
    },
  ),
  //တခြားမြို့အိမ်ရောက်ပို့ခ
  Division(
    name: "တခြားမြို့အိမ်ရောက်ပို့ခ",
    townShipMap: {
      "2500": [
        "စစ်ကိုင်း ပို့ခ ၂၅၀၀ ကျပ်",
        "မုံရွာ ပို့ခ ၂၅၀၀ ကျပ်",
        "ပြင်ဦးလွင် ပို့ခ ၂၅၀၀ ကျပ်",
      ],
      "3000": [
        "အနီးစခန်း ပို့ခ ၃၀၀၀ ကျပ်",
        "ကျောက်မဲ ပို့ခ ၃၀၀၀ ကျပ်",
        "လားရှိုး ပို့ခ ၃၀၀၀ ကျပ်",
        "မူဆယ် ပို့ခ ၃၀၀၀ ကျပ်",
        "ဟင်္သာတ ပို့ခ ၃၀၀၀ ကျပ်",
        "ပုသိမ် ပို့ခ ၃၀၀၀ ကျပ်",
        "မိတ္ထီလာ ပို့ခ ၃၀၀၀ ကျပ်",
        "ပျော်ဘွယ် ပို့ခ ၃၀၀၀ ကျပ်",
        "တောင်ကြီး ပို့ခ  ၃၀၀၀ ကျပ်",
        "မော်လမြိုင် ပို့ခ ၃၀၀၀ ကျပ်",
        "မကွေးမြို့ ပို့ခ ၃၀၀၀ ကျပ်",
        "တောင်ငူ ပို့ခ ၃၀၀၀ ကျပ်",
        "တပ်ကုန်း ပို့ခ ၃၀၀၀ ကျပ်",
        "ရမည်းသင်း ပို့ခ ၃၀၀၀ ကျပ်",
        "ပျဉ်းမနား ပို့ခ ၃၀၀၀ ကျပ်",
        "နေပြည်တော် ပို့ခ ၃၀၀၀ ကျပ်",
      ],
      "4000": [
        "စစ်တွေ ပို့ခ ၄၀၀၀ ကျပ်",
        "မြစ်ကြီးနား ပို့ခ ၄၀၀၀ ကျပ်",
        "လယ်ဝေး ပို့ခ ၄၀၀၀ ကျပ်",
      ]
    },
  ),

  Division(
    name: "ဂိတ်ချ",
    townShipMap: {
      "1500": [
        "ဂိတ်ချ ပို့ခ ၁၅၀၀ ကျပ်",
      ],
    },
  ),

];

